import java.util.Random;
import java.util.Scanner;

public class Main {

    public static void main(String[] args) { //題目要求取0到9的亂數值,形成一個10*10(高10值10)的二維陣列
        Scanner scn=new Scanner(System.in);  //這邊Scanner是用來待會設long seed
        Random random=new Random();         //這邊要用0到9"亂數"值,所以設Random
        long seed=scn.nextLong();          //之後設一個seed
        random.setSeed(seed);     //在random裡設setSeed函數,然後seed放進括號裡,因為seed要取10*10亂數矩陣,所以放在random.setSeed裡
        int[][]data=new int[10][10];   //用2維陣列data取10*10矩陣(高10值10)                      //然後setSeed意思在下方有補充!
        for(int i=0;i<10;i++){  //一開始先取data[][]的亂數值,外圈for i 為高
            for(int j=0;j<10;j++){  //內圈for j為值
                data[i][j]=random.nextInt(10);//每循環到1個目前位於的高(i)跟目前位於的值(j),就從0開始取10個值之間的亂數值->0到9
                System.out.print(data[i][j]+"\t");   //每亂數產生1個值到目前的高(i)跟目前位於的值(j),就來到這行列印出來並且在"\t"
            }
            System.out.println();          //這個println()是用來上方print()裡列印完一行就來到這行換行!繼續換下一行的列印
        }
        System.out.println("側翼取值後: ");  //來到這代表我data[][]的10*10矩陣已經亂數產生處理完畢,而且也給setSeed(seed)吸收了
        for(int a=0;a<10;a++){           //這裡我輸出也是10*10(高10值10),所以這行先當高
            for(int b=0;b<10;b++){      //這裡當值
                System.out.printf("%d\t",data[b][a]); //這時候這行重要!因為他列印的10*10是來自於剛剛上方for i j取10*10的值的"側翼"
            }             //做"側翼取值"來列印,"側翼取值"意思下方有補充 做側翼取值data要有正整數值的陣列參數值跟他輸出是否是側翼取值為一行
            System.out.println();  //每列印一行OK之後就來到這換行!繼續換下一行列印
        }
    }
}
/*
題目:二維亂數陣列行列互換
補充(setSeed()的意思)-> setSeed()用於設定隨機數種子，一個特定的種子可以產生一個特定的偽隨機序列，這個函數的主要目的，
                      是讓你的模擬能夠可"重複出現"，因為很多時候我們需要取隨機數，但這段代碼(我的seed)再跑一次的時候，
                      結果就"不一樣"了，"如果需要重複出現同樣的模擬結果的話"，"就可以用setSeed()"

補充(側翼取值)->比方說,你看1 9 1 1 0 1 5 5 3 6這直排,就是所謂的側翼,所以從1 9 1 1 0 1 5 5 3 6取完後到接下來換7 5 2 0 3 7 9 8 3 6這排
             接著取側翼取值取到最後到3 6 5 0 4 6 6 4 8 9這排!

補充(data[][]跟long seed關係)->data[][]這邊要用"random"取10*10的隨機亂數給seed,因為當初seed丟到random裡的setSeed,所以設一個data[][],
                             利用他用"random"去取10*10的隨機亂數值,並且用setSeed保持這10*10的隨機亂數值!之後每一個隨機亂數值從高0值0開
                             始到高9值9,也就是所謂10*10全部的值都會保存起來丟給setSeed()裡的seed,所以只要代碼(seed)輸入,就會依程式要
                             求列出10*10陣列保存起來的亂數值

輸入->1723 <-(long seed(代碼))
A:->(未用側翼取值前)如下:                        A:(最終答案,也就是用側翼取值後)如下:
1	7	2	7	2	8	6	7	1	3	     1   9   1   1   0   1   5   5   3   6
9	5	5	2	4	2	7	5	2	6	     7   5   2   0   3   7   9   8   3   6
1	2	2	3	5	0	9	4	2	5	     2   5   2   4   6   3   4   2   5   0
1	0	4	1	6	0	6	3	5	0	     7   2   3   1   7   7   4   8   7   9
0	3	6	7	7	0	2	6	6	4	     2   4   5   6   7   9   3   5   1   7
1	7	3	7	9	1	1	4	8	6	     8   2   0   0   0   1   6   1   1   8
5	9	4	4	3	6	8	2	8	6	     6   7   9   6   2   1   8   3   7   3
5	8	2	8	5	1	3	0	7	4	     7   5   4   3   6   4   2   0   0   2
3	3	5	7	1	1	7	0	9	8	     1   2   2   5   6   8   8   7   9   2
6	6	0	9	7	8	3	2	2	9        3   6   5   0   4   6   6   4   8   9
 */
