import java.util.Scanner;

public class Main {

    public static void main(String[] args) {    //設值-> 6 4
        Scanner scn=new Scanner(System.in);
       int n=scn.nextInt();  //n設6
       int m=scn.nextInt();  //m設4
       System.out.println(f(n)+f(m));  //把n->6 m->4丟進ln裡的(f(n)+f(m))得->(f(6)+f(4))
    }                                //之後把(f(6)+f(4))丟入下方遞迴函數,因為ln裡有下"f"函數名稱,所以會把值都拉去下面算
    public static int f(int x){    //(f(6)+f(4))丟入至int f(int x)裡  之後int x裡一次取一個值先f(6)在f(4),之後返回再丟時,一樣先算
        if(x==1){                   //f(6)分解的值,再來就是f(4)分解的值
            return x+1;            //如果分解到後面,x==1丟入此行,在return x+1,注意:這邊return沒下函數名稱,所以一但丟進去return返回,
        }else {                     //該值是不會再丟進遞迴函數裡   |   else這邊是x>1時丟的
            return f(x-1)+f(x/2);   //分解公式,分解完丟回去,這裡有下"f"函數名稱,所以分解的值可以再丟入遞迴函數裡!
        }
    }
}
/*
題目:遞迴函數練習 (兩個正整數相加版本)
補充 return f(x-1)+f(x/2)->f(x/2)這邊也可以改成f((int)Math.floor(x/2))->意思就是說我用Math.floor先把x的值/2,
                                 除以2(/2)取到的正整數值用floor,不4捨五入,然後之後轉int值,該分解正整數值就可以回傳了

6=5+3
 =(4+2)+(2+1)
 =(3+2)+(1+1)+(1+1)+1
 =(2+1)+(1+1)+1+1+1+1+1
 =(1+1)+1+1+1+1+1+1+1+1
 =1+1+1+1+1+1+1+1+1+1=(1+1)+(1+1)+(1+1)+(1+1)+(1+1)+(1+1)+(1+1)+(1+1)+(1+1)+(1+1)="20" <-把最後算出來如有1的值帶進去if(x==1)
 得 x+1 ->return x+1;
4=3+2
 =(2+1)+(1+1)
 =(1+1)+1+1+1
 =1+1+1+1+1=(1+1)+(1+1)+(1+1)+(1+1)+(1+1)="10" <-把最後算出來的值如有1的帶進去if(x==1) 得 x+1 ->return x+1;
 20+10="30"
A:(1.)6 4
    A:30
 */
