import java.util.Scanner;

public class Main {

    public static void main(String[] args) {  //以題目來做說明!
        Scanner scn=new Scanner(System.in);
        int [][]arr=new int[5][7];   //題目要高是5 列數是7  所以每一行的高的值是7個值
        for(int i=0;i<5;i++){        //所以arr塞5個高
            for(int j=0;j<7;j++){    //外加7個值給arr
                arr[i][j]=scn.nextInt();  //用我所輸入的正整數一個一個值慢慢取!  這時候全部取完,目前的arr[i][j]跟我下方的題目一樣
            }
        }  //這時候看到下方程式碼部分,因為題目是從原本的高5值7變成高7值5列印,然後她每一行的高算下來都是原本題目的側翼一列一列取,進而變成高7值5
        for(int k=0;k<7;k++){  //列印是變成高7值5,所以第二個for迴圈外圈一樣當高
            for(int k1=0;k1<5;k1++){  //之後這行高的值是5,所以這行當值
                System.out.printf(arr[k1][k]+"\t"); //重點是這行,把我取到的高(k)跟值(k1)互換,變成arr[k1][k],然後arr原本就有取正整數
            }               //值了,所以把我有arr正整數值依照arr[k1][k]方式"變成arr裡的正整數取值方式變成側翼取值"
            System.out.println();   //之後第一行高OK之後就是變成第一行高有5個值,之後println換行繼續換下一個高! 然後以此類推的動作
        }
    }
}
/*
題目:陣列行列互換
補充:側翼是像題目裡的81 90 9 28 5這行就是側翼,再來繼續取7 67 54 8 1,以此類推取側翼
補充:用printf原因是因為我要用"\t",這樣要+f去下,然後這樣下列印出來的題目比較整齊!
補充:列數高意思是"這個高的數字值"
81 7 7 10 97 0 97
90 67 8 25 1 39 34
9 54 63 53 53 55 77
28 8 17 50 41 99 89
5 1 95 99 76 92 60
(上方是題目 下方是答案)                               k1  k        k1  k       k1  k       k1  k       k1  k
A:81  90  9   28  5                   圖像-> (81)  0   0  (90)  1   0  (9)  2   0  (28) 3   0  (5)  4   0
  7   67  54  8   1                         (7)   0   1  (67)  1   1  (54) 2   1  (8)  3   1  (1)  4   1
  7   8   63  17  95                        (7)   0   2  (8)   1   2  (63) 2   2  (17) 3   2  (95) 4   2
  10  25  53  50  99                        (10)  0   3  (25)  1   3  (53) 2   3  (50) 3   3  (99) 4   3
  97  1   53  41  76                      之後答案下面的列數高是一模一樣取"側翼"的算法演練
  0   39  55  99  92
  97  34  77  89  60
 */
